{
  "slug": "18-november-2025-outage",
  "title": "Cloudflare outage on November 18, 2025",
  "url": "https://blog.cloudflare.com/18-november-2025-outage/",
  "publishedAt": "Tue, 18 Nov 2025 00:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare Outage Summary**\n\nOn November 18, 2025, Cloudflare experienced a significant network failure, resulting in a spike in 5xx error HTTP status codes. The issue was caused by a change to database system permissions, which resulted in a feature file used by the Bot Management system doubling in size. This exceeded the software's limit, causing it to fail. The failure was initially misattributed to a hyper-scale DDoS attack, but was later identified as a result of the oversized feature file.\n\n**Key Technical Details**\n\n* The feature file, which is used to keep the Bot Management system up to date with ever-changing threats, was generated every five minutes by a query running on a ClickHouse database cluster.\n* The query was gradually updated to improve permissions management, resulting in bad data being generated if the query ran on a part of the cluster that had been updated.\n* The bad feature file was rapidly propagated across the network, causing the system to fail.\n* The issue was resolved by stopping the generation and propagation of the bad feature file, manually inserting a known good file into the feature file distribution queue, and forcing a restart of the core proxy.\n\n**Practical Implications for Developers**\n\n* The outage highlights the importance of monitoring and understanding the behavior of complex systems, particularly those with multiple dependencies and cascading failures.\n* Developers should be aware of the potential for seemingly unrelated changes to have significant impacts on system behavior.\n* The use of feature flags and canary releases can help mitigate the effects of cascading failures by allowing for controlled rollouts and rollbacks.\n* Regular testing and validation of system behavior can help identify potential issues before they become critical.",
  "authors": [
    "Matthew Prince"
  ],
  "categories": [
    "Outage",
    "Post Mortem",
    "Bot Management"
  ],
  "guid": "oVEUcpjyyDA8DSSXiE7E6"
}