{
  "slug": "5-december-2025-outage",
  "title": "Cloudflare outage on December 5, 2025",
  "url": "https://blog.cloudflare.com/5-december-2025-outage/",
  "publishedAt": "Fri, 05 Dec 2025 00:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare Outage on December 5, 2025: Key Technical Details and Implications**\n\nOn December 5, 2025, Cloudflare experienced a network-wide outage that lasted approximately 25 minutes, affecting around 28% of all HTTP traffic served by the company. The incident was triggered by changes made to Cloudflare's body parsing logic while attempting to detect and mitigate an industry-wide vulnerability in React Server Components. Specifically, the issue arose from an increased buffer size being rolled out to protect customers against the CVE-2025-55182 vulnerability, which caused an error state in the company's FL1 proxy under certain circumstances.\n\n**Practical Implications for Developers**\n\nThe outage affected customers who had their web assets served by Cloudflare's older FL1 proxy and had the Cloudflare Managed Ruleset deployed. These customers experienced HTTP 500 errors, with the exception of some test endpoints. Developers who rely on Cloudflare's services should be aware of the following:\n\n* The issue was caused by a bug in the rules module of the FL1 proxy, which led to a Lua exception.\n* The bug was identified shortly after the change was applied and was reverted at 09:12, restoring all traffic to normal.\n* Customers who were not impacted did not have the Cloudflare Managed Ruleset deployed or were served by Cloudflare's China network.\n\n**Lessons Learned and Future Improvements**\n\nCloudflare acknowledges that any outage of their systems is unacceptable and is working to prevent similar incidents from occurring in the future. The company will be publishing details next week about the work being done to improve their systems and prevent similar outages.",
  "authors": [
    "Dane Knecht"
  ],
  "categories": [
    "Outage",
    "Post Mortem"
  ],
  "guid": "7lRsBDx09Ye8w2dhpF0Yc"
}