{
  "slug": "cname-a-record-order-dns-standards",
  "title": "What came first: the CNAME or the A record?",
  "url": "https://blog.cloudflare.com/cname-a-record-order-dns-standards/",
  "publishedAt": "Wed, 14 Jan 2026 00:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Summary of Incident: CNAME Ordering Change in 1.1.1.1**\n\nOn January 8, 2026, a routine update to Cloudflare's 1.1.1.1 DNS resolver aimed at reducing memory usage accidentally triggered a wave of DNS resolution failures. The root cause was a subtle shift in the order of records within DNS responses, specifically the reordering of CNAME records. This change broke specific DNS client implementations that expect CNAME records to appear before other records in the response.\n\n**Key Technical Details:**\n\n* The change was introduced on December 2, 2025, and released to the testing environment on December 10, 2025.\n* The code change affected the `fill_cache` method in the `PartialChain` implementation, which now appends CNAME records to the existing answer list instead of inserting them first.\n* This change caused CNAME records to appear at the bottom of the response, after the final resolved answer.\n\n**Practical Implications for Developers:**\n\n* Some DNS client implementations may break or behave unexpectedly when receiving responses with CNAME records in the wrong order.\n* Developers should be aware of the potential impact of this change and test their DNS client implementations accordingly.\n* The incident highlights the importance of careful testing and validation of changes to DNS response formats.\n\n**Timeline:**\n\n* December 2, 2025: Record reordering change introduced to 1.1.1.1 codebase\n* December 10, 2025: Change released to testing environment\n* January 7, 2026: Global release containing the change starts\n* January 8, 2026: Incident declared and release reverted\n\nThe incident serves as a reminder of the importance of careful testing and validation of changes to DNS response formats, as well as the potential impact on DNS client implementations.",
  "authors": [
    "Sebastiaan Neuteboom"
  ],
  "categories": [
    "1.1.1.1",
    "Post Mortem",
    "DNS",
    "Resolver",
    "Standards",
    "Bugs",
    "Consumer Services"
  ],
  "guid": "3fP84BsxwSxKr7ffpmVO6s"
}