{
  "slug": "ddos-threat-report-2025-q3",
  "title": "Cloudflare's 2025 Q3 DDoS threat report -- including Aisuru, the apex of botnets",
  "url": "https://blog.cloudflare.com/ddos-threat-report-2025-q3/",
  "publishedAt": "Wed, 03 Dec 2025 14:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare's 2025 Q3 DDoS Threat Report Highlights Aisuru Botnet's Record-Breaking Attacks**\n\nCloudflare's latest Quarterly DDoS Threat Report reveals a significant increase in Distributed Denial of Service (DDoS) attacks in the third quarter of 2025, with a focus on the Aisuru botnet. Aisuru, a massive botnet with an estimated 1-4 million infected hosts globally, unleashed hyper-volumetric DDoS attacks that routinely exceeded 1 terabit per second (Tbps) and 1 billion packets per second (Bpps). These attacks peaked at 29.7 Tbps and 14.1 Bpps, setting new records.\n\n**Key Insights and Statistics:**\n\n* Aisuru launched an average of 14 hyper-volumetric attacks daily, a 54% quarter-over-quarter (QoQ) increase.\n* DDoS attack traffic against AI companies surged by 347% month-over-month (MoM) in September 2025.\n* Escalating EU-China trade tensions led to a significant increase in DDoS attacks against the Mining, Minerals & Metals industry and the Automotive industry.\n* Cloudflare mitigated 8.3 million DDoS attacks in the third quarter of 2025, a 15% QoQ and 40% year-over-year (YoY) increase.\n* Network-layer DDoS attacks accounted for 71% of the DDoS attacks in 2025 Q3, increasing by 87% QoQ and 95% YoY.\n\n**Practical Implications for Developers:**\n\n* Aisuru's attacks demonstrate the importance of robust DDoS mitigation systems and the need for developers to prioritize security in their applications and infrastructure.\n* The increase in DDoS attacks against AI companies highlights the need for developers to ensure their AI-powered systems are secure and resilient against potential threats.\n* The record-breaking attacks set by Aisuru emphasize the importance of staying up-to-date with the latest security best practices and technologies to protect against emerging threats.\n\n**Recommendations:**\n\n* Developers should prioritize security in their applications and infrastructure to prevent DDoS attacks.\n* Implement robust DDoS mitigation systems to detect and mitigate potential threats.\n* Stay informed about emerging threats and security best practices to ensure the security and resilience of applications and infrastructure.",
  "authors": [
    "Omer Yoachimik",
    "Jorge Pacheco"
  ],
  "categories": [
    "DDoS Reports",
    "DDoS"
  ],
  "guid": "1lRRUtB2DMN3pPhk7yfeSM"
}