{
  "slug": "fail-small-resilience-plan",
  "title": "Code Orange: Fail Small — our resilience plan following recent incidents",
  "url": "https://blog.cloudflare.com/fail-small-resilience-plan/",
  "publishedAt": "Fri, 19 Dec 2025 22:35:30 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare Announces \"Code Orange: Fail Small\" Resilience Plan Following Recent Incidents**\n\nCloudflare has initiated a new resilience plan, \"Code Orange: Fail Small,\" in response to two recent network failures that affected traffic delivery for certain customers. The plan aims to prevent similar outages by implementing controlled rollouts for configuration changes, reviewing and improving failure modes of systems handling network traffic, and revising internal \"break glass\" procedures to ensure swift access to all systems during incidents.\n\n**Key Technical Details and Main Announcements**\n\nThe \"Code Orange\" plan is organized into three main areas:\n\n1. **Controlled Rollouts**: Configuration changes will be deployed in a controlled and monitored fashion, similar to software binary releases.\n2. **Failure Mode Review and Improvement**: Cloudflare will review, improve, and test failure modes of all systems handling network traffic to ensure well-defined behavior under unexpected error states.\n3. **Internal \"Break Glass\" Procedures**: Cloudflare will revise internal procedures to remove circular dependencies and ensure swift access to all systems during incidents.\n\n**Practical Implications for Developers**\n\nThe \"Code Orange\" plan will deliver iterative improvements, rather than a single \"big bang\" change. Cloudflare expects its network to be much more resilient, including for issues that triggered the recent global incidents. Developers can expect improved reliability and reduced downtime due to the controlled rollout of configuration changes and the review of failure modes.\n\n**Timeline and Expectations**\n\nWhile no specific timeline is mentioned, Cloudflare expects the \"Code Orange\" plan to be a top priority for the company, with iterative improvements delivered as the project progresses. The ultimate goal is to create a more resilient network that can withstand errors or mistakes that could lead to major outages.",
  "authors": [
    "Dane Knecht"
  ],
  "categories": [
    "Outage",
    "Post Mortem",
    "Code Orange"
  ],
  "guid": "DMVZ2E5NT13VbQvP1hUNj"
}