{
  "slug": "h1-2025-transparency-report",
  "title": "Innovating to address streaming abuse — and our latest transparency report",
  "url": "https://blog.cloudflare.com/h1-2025-transparency-report/",
  "publishedAt": "Fri, 19 Dec 2025 14:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare's Approach to Streaming Abuse and Transparency Report**\n\nCloudflare has released its latest transparency report, covering the first half of 2025. The report highlights the company's efforts to address streaming abuse and copyright infringement, which has become increasingly sophisticated due to the use of AI tools and other systems for abuse. Cloudflare has responded by experimenting with new ways to identify and respond to allegations of streaming and copyright infringement, working closely with rightsholders to better identify domains and accounts that might be streaming.\n\n**Key Technical Details**\n\nCloudflare's approach to streaming abuse involves a service-specific approach to abuse, reflecting the nature of the services provided, legal requirements, and human rights considerations. This approach means that Cloudflare treats hosted content differently than content on websites that use their security and CDN services. Cloudflare has also developed systems that learn from abuse reports, improving their ability to detect and mitigate abuse on their network.\n\n**Practical Implications for Developers**\n\nDevelopers using Cloudflare's services should be aware of the company's efforts to address streaming abuse and copyright infringement. This may involve implementing additional security measures to prevent unauthorized streaming and ensuring that their content is not being used for copyright infringement. Cloudflare's approach to abuse reporting also highlights the importance of systems that learn from abuse reports, enabling developers to better protect their customers from a wide range of cyber threats.\n\n**Timeline and Future Developments**\n\nCloudflare's transparency report is published twice a year, providing updates on the company's approach to abuse and copyright infringement. The report highlights the company's efforts to innovate and improve their systems to address the rapidly evolving threats posed by AI and other technologies. Developers can expect Cloudflare to continue to develop and refine their approach to streaming abuse and copyright infringement, ensuring that their services remain secure and reliable.",
  "authors": [
    "Justin Paine"
  ],
  "categories": [
    "Transparency"
  ],
  "guid": "5mt8quFYw1l3UpRAh6JsHU"
}