{
  "slug": "human-native-joins-cloudflare",
  "title": "Human Native is joining Cloudflare",
  "url": "https://blog.cloudflare.com/human-native-joins-cloudflare/",
  "publishedAt": "Thu, 15 Jan 2026 14:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare Acquires Human Native to Enhance AI Data Marketplace**\n\nCloudflare has acquired Human Native, a UK-based AI data marketplace specializing in transforming multimedia content into searchable and useful data. Human Native's technology helps publishers and developers turn messy, unstructured content into something that can be understood, licensed, and valued. This acquisition will accelerate Cloudflare's work in helping customers transform their content to be easily accessed and understood by AI bots and agents.\n\n**Key Technical Details and Implications for Developers**\n\nThe acquisition will enable Cloudflare to provide developers with better tools for working with AI data, including:\n\n1. **AI Index**: A powerful new way for both foundation model companies and agents to access content at scale, using a pub/sub model that allows participating websites to expose structured updates whenever their content changes.\n2. **AI Crawl Control**: A tool that allows content owners to decide how and when their content is accessed by AI systems, with options for direct compensation and control.\n3. **Pay Per Crawl**: A tool that enables content owners to receive compensation for their content being accessed by AI systems.\n\nThese tools will help developers build better AI models by providing access to high-quality, licensed data, and will enable content creators to experiment with new business models.\n\n**Timeline and Future Developments**\n\nCloudflare is investing heavily in creating the foundations for these new business models, starting with the x402 Foundation, in partnership with Coinbase. This will enable machine-to-machine transactions and further accelerate the development of AI data marketplaces.",
  "authors": [
    "Will Allen",
    "James Smith"
  ],
  "categories": [
    "AI",
    "Generative AI",
    "Data",
    "Acquisitions",
    "Developer Platform"
  ],
  "guid": "Szd19ssv1kbKxjxNZhUmR"
}