{
  "slug": "r2-sql-aggregations",
  "title": "Announcing support for GROUP BY, SUM, and other aggregation queries in R2 SQL",
  "url": "https://blog.cloudflare.com/r2-sql-aggregations/",
  "publishedAt": "Thu, 18 Dec 2025 14:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare Announces Support for GROUP BY, SUM, and Other Aggregation Queries in R2 SQL**\n\nCloudflare has announced the addition of support for aggregations in R2 SQL, its serverless, distributed analytics query engine. Aggregations, also known as \"GROUP BY queries,\" provide a quick overview of large datasets by grouping rows into buckets and calculating summary statistics. This feature will enable users to spot trends, generate reports, and find anomalies in logs.\n\n**Key Technical Details**\n\nR2 SQL now supports the following aggregation functions:\n\n* GROUP BY: splits table rows into buckets based on a specified column\n* SUM: calculates the total value of a column for each bucket\n* COUNT: counts the number of rows in each bucket\n* ORDER BY: sorts buckets by a specified column\n* HAVING: filters buckets based on a condition\n\nDevelopers can use these functions to create complex queries, such as generating reports on sales by department or filtering out anomalies.\n\n**Practical Implications for Developers**\n\nThe addition of aggregations in R2 SQL will enable developers to:\n\n* Analyze large datasets more efficiently\n* Generate reports and insights from data\n* Identify trends and anomalies in logs\n* Optimize database queries for better performance\n\nDevelopers can use R2 SQL to run aggregation queries over data stored in R2 Data Catalog, making it an ideal solution for analytics workloads.\n\n**Two Approaches to Aggregation**\n\nR2 SQL uses two approaches to aggregation: computing aggregate values sooner or later. Computing aggregate values sooner involves splitting the query into two phases: computing new columns and then executing the rest of the query. Computing aggregate values later involves computing them partially and merging results just before returning them to the user.",
  "authors": [
    "Jérôme Schneider",
    "Nikita Lapkov",
    "Marc Selwan"
  ],
  "categories": [
    "R2",
    "Data",
    "Edge Computing",
    "Rust",
    "Serverless",
    "SQL"
  ],
  "guid": "1qWQCp4QfhsZAs27s7fEc0"
}