{
  "slug": "r2-sql-aggregations",
  "title": "Announcing support for GROUP BY, SUM, and other aggregation queries in R2 SQL",
  "url": "https://blog.cloudflare.com/r2-sql-aggregations/",
  "publishedAt": "Thu, 18 Dec 2025 14:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare Announces Support for GROUP BY, SUM, and Other Aggregation Queries in R2 SQL**\n\nCloudflare has announced the addition of support for aggregations in R2 SQL, its serverless, distributed analytics query engine. Aggregations, also known as \"GROUP BY queries,\" provide a quick overview of large datasets by grouping rows into buckets and calculating summary statistics. This feature is particularly useful for generating reports, spotting trends, and finding anomalies in logs.\n\n**Key Technical Details**\n\nR2 SQL now supports the following aggregation functions:\n\n* GROUP BY: splits table rows into buckets based on a specified column\n* SUM: calculates the total value of a column for each bucket\n* COUNT: counts the number of rows in each bucket\n* ORDER BY: sorts buckets by a specified column\n* HAVING: filters buckets based on a condition\n\n**Practical Implications for Developers**\n\nThe addition of aggregations in R2 SQL enables developers to:\n\n* Generate reports on sales, customer behavior, or other business metrics\n* Identify trends and patterns in large datasets\n* Filter out anomalies and outliers\n* Optimize query performance by computing aggregates on the fly or partially\n\n**Two Approaches to Aggregation**\n\nR2 SQL uses two approaches to aggregation:\n\n* Compute sooner: computing aggregates before sorting or filtering\n* Compute later: computing aggregates after sorting or filtering\nThe choice between these approaches depends on the specific query requirements and performance considerations.",
  "authors": [
    "Jérôme Schneider",
    "Nikita Lapkov",
    "Marc Selwan"
  ],
  "categories": [
    "R2",
    "Data",
    "Edge Computing",
    "Rust",
    "Serverless",
    "SQL"
  ],
  "guid": "1qWQCp4QfhsZAs27s7fEc0"
}