{
  "slug": "r2-sql-aggregations",
  "title": "Announcing support for GROUP BY, SUM, and other aggregation queries in R2 SQL",
  "url": "https://blog.cloudflare.com/r2-sql-aggregations/",
  "publishedAt": "Thu, 18 Dec 2025 14:00:00 GMT",
  "summary": "**AI-Generated Summary**: This is an automated summary of a Cloudflare blog post created using AI. For the full details and context, please read the original post.\n\n**Cloudflare Announces Support for GROUP BY, SUM, and Other Aggregation Queries in R2 SQL**\n\nCloudflare has announced the addition of support for aggregations in R2 SQL, its serverless, distributed analytics query engine. Aggregations, also known as \"GROUP BY queries,\" provide a quick overview of large datasets by grouping rows into buckets and calculating summary statistics. This feature allows users to spot trends, generate reports, and find anomalies in logs.\n\n**Key Technical Details**\n\nR2 SQL now supports common aggregation functions such as `SUM`, `COUNT`, and `GROUP BY`. These functions can be used in `SELECT` statements to calculate summary statistics, and in `HAVING` and `ORDER BY` statements to filter and sort data. The query engine splits aggregation queries into two phases: computing new columns and executing the rest of the query.\n\n**Practical Implications for Developers**\n\nThe addition of aggregation support in R2 SQL enables developers to:\n\n* Generate reports on large datasets by grouping rows into buckets and calculating summary statistics\n* Spot trends and anomalies in data by filtering and sorting on aggregate values\n* Optimize query performance by using partial computation and merging results before returning them to the user\n\nDevelopers can use R2 SQL to perform complex analytics workloads on large datasets, making it an essential tool for data analysis and reporting.",
  "authors": [
    "Jérôme Schneider",
    "Nikita Lapkov",
    "Marc Selwan"
  ],
  "categories": [
    "R2",
    "Data",
    "Edge Computing",
    "Rust",
    "Serverless",
    "SQL"
  ],
  "guid": "1qWQCp4QfhsZAs27s7fEc0"
}